data/openfoam/channel_flow/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    inlet
    {
        type            cyclic;
        inGroups        List<word> 1(cyclic);
        nFaces          40;
        startFace       3120;
        matchTolerance  0.0001;
        neighbourPatch  outlet;
        transformType   translational;
        separation      (-2 0 0);
    }
    outlet
    {
        type            cyclic;
        inGroups        List<word> 1(cyclic);
        nFaces          40;
        startFace       3160;
        matchTolerance  0.0001;
        neighbourPatch  inlet;
        transformType   translational;
        separation      (2 0 0);
    }
    fixedWalls
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          80;
        startFace       3200;
    }
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          3200;
        startFace       3280;
    }
)

// ************************************************************************* //
