data/openfoam/channel_flow/constant/fvModels
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvModels;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// include packaged fvModels using #includeModel
// #includeModel ...

momentumSource
{
    type        semiImplicitSource;
    cellZone    all;
    volumeMode  specific;

    sources
    {
        U
        {
            explicit    (1 0 0);
            implicit    0;
        }
    }
}

//************************************************************************ //
